<?php

namespace AppBundle\DataFixtures;

use AppBundle\Entity\Muscle;
use AppBundle\Entity\Trainer;
use AppBundle\Entity\TrainerCategory;
use Doctrine\Bundle\FixturesBundle\Fixture;
use Doctrine\Common\DataFixtures\DependentFixtureInterface;
use Doctrine\Common\Persistence\ObjectManager;

class TrainersFixtures extends Fixture implements DependentFixtureInterface
{
    public function getDependencies()
    {
        return array(
            MusclesFixtures::class,
        );
    }

    public function load(ObjectManager $manager)
    {
        $data = $this->getTrainers();

        foreach ($data as $categoryName => $items) {
            $category = new TrainerCategory();
            $category->setTitle($categoryName);
            $manager->persist($category);

            foreach ($items as $trainerName => $muscles) {
                $trainer = new Trainer();
                $trainer->setTitle($trainerName);
                $trainer->setCategory($category);

                foreach ($muscles as $muscleReference) {
                    /** @var Muscle $muscle */
                    $muscle = $this->getReference($muscleReference);
                    $trainer->addMuscle($muscle);
                }

                $manager->persist($trainer);
            }
        }

        $manager->flush();
    }


    private function getTrainers()
    {
        /*
            Поддерживаемый формат:

            "Упражнения со штангой" => [
                "Сгибание рук со штангой" => [MusclesFixtures::BICEPS_REFERENCE],
                "Жим штанги лежа" => [MusclesFixtures::CHEST_REFERENCE, MusclesFixtures::TRICEPS_REFERENCE],
                "Армейский жим" => [],
            ],
        */

        $data = [
            "Общая категория" => [
                "Армейский жим" => [],
                "Боковой наклон" => [],
                "Боковое скручивание" => [],
                "Вертикальное отжимание на тренажере" => [],
                "Выпады" => [],
                "Гакк-приседания" => [],
                "Гиперэкстензии" => [],
                "Гоблет приседания" => [],
                "Жим Арнольда" => [],
                "Жим гантелей лежа" => [],
                "Жим гантелей на наклонной скамье" => [],
                "Жим гантелей сидя" => [],
                "Жим гантелей сидя для женщин" => [],
                "Жим из-за головы" => [],
                "Жим лежа" => [],
                "Жим лежа узким хватом" => [],
                "Жим ногами" => [],
                "Жим ногами на тренажере" => [],
                "Жим одной ногой" => [],
                "Жим штанги на скамье с наклоном вверх" => [],
                "Жим штанги на скамье с наклоном вниз" => [],
                "Жим штанги сидя" => [],
                "Жим штанги стоя" => [],
                "Кроссовер" => [],
                "Махи руками в стороны" => [],
                "Наклоны вперед со штангой" => [],
                "Отведение ноги на блоке" => [],
                "Отжимания на брусьях" => [],
                "Отжимания" => [],
                "Планка" => [],
                "Подтягивание" => [],
                "Подтягивания узким хватом" => [],
                "Подъем гантелей на бицепс" => [],
                "Подъем на бицепс сидя" => [],
                "Подъем ног из упора лежа" => [],
                "Подъем плеч с гантелями" => [],
                "Подъем рук с гантелями перед собой" => [],
                "Подъем штанги на бицепс" => [],
                "Поочередное сгибание рук с гантелями" => [],
                "Приседания" => [],
                "Приседания на тренажере Смита" => [],
                "Приседания с гантелями" => [],
                "Приседания со штангой" => [],
                "Пулловер" => [],
                "Разведение гантелей в стороны" => [],
                "Разведение гантелей в стороны в наклоне" => [],
                "Разведение ног на тренажере" => [],
                "Разведение рук лежа" => [],
                "Разведение рук с гантелями" => [],
                "Разведение рук сидя" => [],
                "Разведение рук стоя" => [],
                "Разгибание бедра" => [],
                "Разгибание ног лежа" => [],
                "Разгибание ног на блоке" => [],
                "Разгибание рук" => [],
                "Разгибание рук лежа" => [],
                "Разгибания ног в тренажере" => [],
                "Разгибания рук на верхнем блоке" => [],
                "Разгибания рук на нижнем блоке" => [],
                "Сведение ног на тренажере" => [],
                "Сгибание рук" => [],
                "Сгибание рук с гантелями" => [],
                "Сгибание рук с гантелями (молоты)" => [],
                "Сгибание рук со штангой" => [],
                "Сгибание ног в станке" => [],
                "Сгибание рук на скамье Скотта" => [],
                "Становая тяга" => [],
                "Тяга блока к груди сидя" => [],
                "Тяга блока к поясу сидя" => [],
                "Тяга блока на бицепс" => [],
                "Тяга верхнего блока к груди" => [],
                "Тяга гантелей в наклоне" => [],
                "Тяга гантелей лежа на животе" => [],
                "Тяга гантели одной рукой стоя в наклоне" => [],
                "Тяга за голову на высоком блоке" => [],
                "Тяга к животу на тренажере" => [],
                "Тяга к подбородку" => [],
                "Тяга к поясу" => [],
                "Тяга штанги в наклоне" => [],
                "Тяга штанги к подбородку" => [],
                "Французский жим" => [],
            ]
        ];
        return $data;
    }
}
